app/controllers/hotels_controller.rb

  def create
    hotel = Hotel.create(hotel_params)
---
INSERT INTO "hotels" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Cemer"], ["created_at", "2022-09-07 17:00:17.238238"], ["updated_at", "2022-09-07 17:00:17.238238"]]

  def update
    @hotel.update(hotel_params)
---
UPDATE "hotels" SET "name" = ?, "updated_at" = ? WHERE "hotels"."id" = ?  [["name", "natraj12"], ["updated_at", "2022-09-07 17:00:32.866729"], ["id", 1]]

  def destroy
    @hotel.destroy
---
DELETE FROM "hotels" WHERE "hotels"."id" = ?  [["id", 2]]

  def current_hotel
    @hotel = Hotel.find(params[:id])
---
SELECT "hotels".* FROM "hotels" WHERE "hotels"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]