app/controllers/hotelgroups_controller.rb

SELECT "hotelgroups".* FROM "hotelgroups"
---
	def index
    @hotelgroups = Hotelgroup.all